{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8c5819f4-03c7-4d21-872e-93e83e659f63",
   "metadata": {},
   "source": [
    "# Fetch tweets from X and save them to graphRAG. Then talk with the data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5f0b86bd-885d-4e67-8cb0-ab286db38d15",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import libraries\n",
    "import dotenv\n",
    "import os\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c2f2adb7-ead9-4de5-9ba3-ec9a5bf72346",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import datetime"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "68ee4316-f3c1-4279-bb1c-d861c6fbea2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from openai import OpenAI"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "81c26842-ce67-485b-8d93-537fb69611ba",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "643b0afd-241e-40af-94e6-957d8546a972",
   "metadata": {},
   "outputs": [],
   "source": [
    "client = OpenAI()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f2d4dd32-d602-4031-b95b-3475287dee23",
   "metadata": {},
   "outputs": [],
   "source": [
    "# load environment variables\n",
    "load_status = dotenv.load_dotenv(\".env\")\n",
    "if load_status is False:\n",
    "    raise RuntimeError('Environment variables are not found.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "d1d9d601-b0f7-42fa-8aa0-1cd70ce731d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')\n",
    "BEARER_TOKEN = os.getenv(\"BEARER_TOKEN\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "6acb1d61-2335-4f00-b647-4b853d0f52f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "neo4j://localhost:7687\n",
      "neo4j\n",
      "neo4j123\n",
      "Neo4j\n"
     ]
    }
   ],
   "source": [
    "print(NEO4J_URI)\n",
    "print(NEO4J_USERNAME)\n",
    "print(NEO4J_PASSWORD)\n",
    "print(NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "44518d95-d491-4292-a84d-bd88d9818241",
   "metadata": {},
   "outputs": [],
   "source": [
    "VECTOR_INDEX_NAME = 'tweets'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "fdf59d81-3e06-431e-81e2-92496ea5f78c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# connect to graph database\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "f4859049-68ca-4182-8766-5cc026997019",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "  SHOW VECTOR INDEXES\n",
    "  \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "c229b3a3-b648-43f5-a850-d3c30cb4627c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create header for X service\n",
    "def create_headers(bearer_token):\n",
    "  return {\n",
    "    \"Authorization\": \"Bearer {}\".format(bearer_token)\n",
    "  }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "0b57843a-ada3-4560-94fc-3bc3963985ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "# get tweets from X using start time and end time\n",
    "def get_tweets(query, max_results=10, start_time=None, end_time=None):\n",
    "  url = \"https://api.twitter.com/2/tweets/search/recent\"\n",
    "  headers = create_headers(BEARER_TOKEN)\n",
    "  params = {\n",
    "    \"query\": query,\n",
    "    \"max_results\": max_results,\n",
    "    \"tweet.fields\": \"created_at,author_id,text\"\n",
    "  }\n",
    "  if start_time:\n",
    "    params[\"start_time\"] = start_time\n",
    "  if end_time:\n",
    "    params[\"end_time\"] = end_time\n",
    "  response = requests.get(url, headers=headers, params=params)\n",
    "  if response.status_code != 200:\n",
    "    raise Exception(response.status_code, response.text)\n",
    "  return response.json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "33d57d4e-5bdd-4844-bd9e-099033d84a5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# clean tweet and remove commercial tweets\n",
    "def clean_tweet(tweet):\n",
    "    messages = []\n",
    "    system_prompt = \"You assist user to clean the tweet and produce a json output. Do not output anything other than json. Do not use markup language.\"\n",
    "    messages.append(\n",
    "                    {\n",
    "                        \"role\": \"system\", \n",
    "                        \"content\": system_prompt\n",
    "                    })\n",
    "    prompt_template = \"\"\"The tweet is the following: {tweet}  Can you summarize the tweet in English and remove all the extra characters, emojis and links. If the tweet is promoting or selling something, return an empty string. Set \"text=\" to the sanitized tweet. If \"text\" contains predictions, set \"category\"=\"Yes\", otherwise set \"category\"=\"No\" Returns a json with keyword text and category and values ​​\"text\" and \"category\" that can be read by json.load()\"\"\"\n",
    "    messages.append(\n",
    "                    {\n",
    "                        \"role\": \"user\", \n",
    "                        \"content\": prompt_template.format(tweet=tweet)\n",
    "                    })\n",
    "    # Openai response generation\n",
    "    response = client.chat.completions.create(\n",
    "                #model = \"gpt-4o-2024-05-13\",\n",
    "                model = \"gpt-4o-mini\",\n",
    "                messages = messages,\n",
    "                temperature = 0.1,\n",
    "                max_tokens = 2048,\n",
    "                top_p = 1.0)\n",
    "    return response.choices[0].message.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "6ce96247-f390-485b-bf7c-2baaeae62e46",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create tweet to graph database\n",
    "create_tweets = \"\"\"\n",
    "MERGE (chunk:Tweet {id: $tweet.id})\n",
    "ON CREATE SET \n",
    "    chunk.text = $tweet.text,\n",
    "    chunk.created_at = $tweet.created_at,\n",
    "    chunk.author_id = $tweet.author_id\n",
    "RETURN chunk\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "885da546-3ab6-420c-a0ea-923baba6c3fd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "CREATE CONSTRAINT unique_chunk IF NOT EXISTS \n",
    "    FOR (c:Tweet) REQUIRE c.id IS UNIQUE\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "c8833ae5-a823-4c3f-8ee8-aaa3414c0a92",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create a node fow a query word and link it to tweets\n",
    "def create_link_to_queryword(queryword, tweetid):\n",
    "    # Check if the query node exists\n",
    "    queryword_query = \"MATCH (querynode:Queryword {name: $name}) RETURN querynode\"\n",
    "    querynodes = graph.query(queryword_query, params={\"name\": queryword})\n",
    "\n",
    "    if not querynodes:\n",
    "        print(\"creating query node\")\n",
    "        create_query_node = \"\"\"\n",
    "        MERGE (querynode:Queryword {name: $name})\n",
    "        RETURN querynode\n",
    "        \"\"\"\n",
    "        graph.query(create_query_node, params={\"name\": queryword})\n",
    "\n",
    "    # Create the QUERY_RESULT relationship between tweet and queryword\n",
    "    create_query_relationship_query = \"\"\"\n",
    "    MATCH (querynode:Queryword {name: $name}), (tweet:Tweet {id: $tweetid})\n",
    "    MERGE (querynode)-[:QUERY_RESULT]->(tweet)\n",
    "    \"\"\"\n",
    "    graph.query(create_query_relationship_query, params={\"name\": queryword, \"tweetid\": tweetid})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "8ad65603-0a74-4fb0-8526-4bd53bf49f11",
   "metadata": {},
   "outputs": [],
   "source": [
    "# populate graph database \n",
    "def populate_database(start_time, end_time):\n",
    "  # Change the query to search for tweets from Nvidia within the last week\n",
    "  queryword = \"nvidia\"\n",
    "  query = queryword + \" -is:retweet -is:reply -url:links\"\n",
    "  max_results = 100\n",
    "  tweets = get_tweets(query, max_results, start_time=start_time, end_time=end_time)\n",
    "  count = 1\n",
    "  for tweet in tweets[\"data\"]:\n",
    "    print(count)\n",
    "    #print(f\"Tweet: {tweet['text']}\")\n",
    "    print(f\"Tweet id: {tweet['id']}\")\n",
    "    print(f\"Created at: {tweet['created_at']}\")\n",
    "    #print(f\"Author ID: {tweet['author_id']}\")\n",
    "    graph.query(create_tweets, params={'tweet': tweet})\n",
    "    create_link_to_queryword(queryword, tweet['id'])\n",
    "    count = count +1\n",
    "\n",
    "    print(\"-\" * 20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "1eb7a731-0114-4a34-9449-5d848eb8901b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2024-08-28T23:30:00Z\n",
      "1\n",
      "Tweet id: 1828938096001405285\n",
      "Created at: 2024-08-28T23:29:56.000Z\n",
      "--------------------\n",
      "2\n",
      "Tweet id: 1828938092574806221\n",
      "Created at: 2024-08-28T23:29:55.000Z\n",
      "--------------------\n",
      "3\n",
      "Tweet id: 1828938088544121120\n",
      "Created at: 2024-08-28T23:29:54.000Z\n",
      "--------------------\n",
      "4\n",
      "Tweet id: 1828938088032165914\n",
      "Created at: 2024-08-28T23:29:54.000Z\n",
      "--------------------\n",
      "5\n",
      "Tweet id: 1828938085985325526\n",
      "Created at: 2024-08-28T23:29:54.000Z\n",
      "--------------------\n",
      "6\n",
      "Tweet id: 1828938070428688418\n",
      "Created at: 2024-08-28T23:29:50.000Z\n",
      "--------------------\n",
      "7\n",
      "Tweet id: 1828938044294013141\n",
      "Created at: 2024-08-28T23:29:44.000Z\n",
      "--------------------\n",
      "8\n",
      "Tweet id: 1828938037830791381\n",
      "Created at: 2024-08-28T23:29:42.000Z\n",
      "--------------------\n",
      "9\n",
      "Tweet id: 1828938020877414693\n",
      "Created at: 2024-08-28T23:29:38.000Z\n",
      "--------------------\n",
      "10\n",
      "Tweet id: 1828938020093104488\n",
      "Created at: 2024-08-28T23:29:38.000Z\n",
      "--------------------\n",
      "11\n",
      "Tweet id: 1828938018117341515\n",
      "Created at: 2024-08-28T23:29:38.000Z\n",
      "--------------------\n",
      "12\n",
      "Tweet id: 1828938018067296458\n",
      "Created at: 2024-08-28T23:29:38.000Z\n",
      "--------------------\n",
      "13\n",
      "Tweet id: 1828938012509806854\n",
      "Created at: 2024-08-28T23:29:36.000Z\n",
      "--------------------\n",
      "14\n",
      "Tweet id: 1828938009837711480\n",
      "Created at: 2024-08-28T23:29:36.000Z\n",
      "--------------------\n",
      "15\n",
      "Tweet id: 1828937999562031579\n",
      "Created at: 2024-08-28T23:29:33.000Z\n",
      "--------------------\n",
      "16\n",
      "Tweet id: 1828937996327915659\n",
      "Created at: 2024-08-28T23:29:33.000Z\n",
      "--------------------\n",
      "17\n",
      "Tweet id: 1828937990913360361\n",
      "Created at: 2024-08-28T23:29:31.000Z\n",
      "--------------------\n",
      "18\n",
      "Tweet id: 1828937980595040666\n",
      "Created at: 2024-08-28T23:29:29.000Z\n",
      "--------------------\n",
      "19\n",
      "Tweet id: 1828937964736414166\n",
      "Created at: 2024-08-28T23:29:25.000Z\n",
      "--------------------\n",
      "20\n",
      "Tweet id: 1828937964564439417\n",
      "Created at: 2024-08-28T23:29:25.000Z\n",
      "--------------------\n",
      "21\n",
      "Tweet id: 1828937960873513303\n",
      "Created at: 2024-08-28T23:29:24.000Z\n",
      "--------------------\n",
      "22\n",
      "Tweet id: 1828937944859615432\n",
      "Created at: 2024-08-28T23:29:20.000Z\n",
      "--------------------\n",
      "23\n",
      "Tweet id: 1828937937633063055\n",
      "Created at: 2024-08-28T23:29:19.000Z\n",
      "--------------------\n",
      "24\n",
      "Tweet id: 1828937926539128925\n",
      "Created at: 2024-08-28T23:29:16.000Z\n",
      "--------------------\n",
      "25\n",
      "Tweet id: 1828937910030327933\n",
      "Created at: 2024-08-28T23:29:12.000Z\n",
      "--------------------\n",
      "26\n",
      "Tweet id: 1828937887976661438\n",
      "Created at: 2024-08-28T23:29:07.000Z\n",
      "--------------------\n",
      "27\n",
      "Tweet id: 1828937877771956251\n",
      "Created at: 2024-08-28T23:29:04.000Z\n",
      "--------------------\n",
      "28\n",
      "Tweet id: 1828937859451236849\n",
      "Created at: 2024-08-28T23:29:00.000Z\n",
      "--------------------\n",
      "29\n",
      "Tweet id: 1828937858796700112\n",
      "Created at: 2024-08-28T23:29:00.000Z\n",
      "--------------------\n",
      "30\n",
      "Tweet id: 1828937847115550862\n",
      "Created at: 2024-08-28T23:28:57.000Z\n",
      "--------------------\n",
      "31\n",
      "Tweet id: 1828937838609740057\n",
      "Created at: 2024-08-28T23:28:55.000Z\n",
      "--------------------\n",
      "32\n",
      "Tweet id: 1828937828446732576\n",
      "Created at: 2024-08-28T23:28:52.000Z\n",
      "--------------------\n",
      "33\n",
      "Tweet id: 1828937817411727413\n",
      "Created at: 2024-08-28T23:28:50.000Z\n",
      "--------------------\n",
      "34\n",
      "Tweet id: 1828937801905152361\n",
      "Created at: 2024-08-28T23:28:46.000Z\n",
      "--------------------\n",
      "35\n",
      "Tweet id: 1828937795374854621\n",
      "Created at: 2024-08-28T23:28:45.000Z\n",
      "--------------------\n",
      "36\n",
      "Tweet id: 1828937766824251827\n",
      "Created at: 2024-08-28T23:28:38.000Z\n",
      "--------------------\n",
      "37\n",
      "Tweet id: 1828937761887240615\n",
      "Created at: 2024-08-28T23:28:37.000Z\n",
      "--------------------\n",
      "38\n",
      "Tweet id: 1828937749933764819\n",
      "Created at: 2024-08-28T23:28:34.000Z\n",
      "--------------------\n",
      "39\n",
      "Tweet id: 1828937740639187067\n",
      "Created at: 2024-08-28T23:28:32.000Z\n",
      "--------------------\n",
      "40\n",
      "Tweet id: 1828937737342492700\n",
      "Created at: 2024-08-28T23:28:31.000Z\n",
      "--------------------\n",
      "41\n",
      "Tweet id: 1828937735937167664\n",
      "Created at: 2024-08-28T23:28:30.000Z\n",
      "--------------------\n",
      "42\n",
      "Tweet id: 1828937731499798555\n",
      "Created at: 2024-08-28T23:28:29.000Z\n",
      "--------------------\n",
      "43\n",
      "Tweet id: 1828937728647671939\n",
      "Created at: 2024-08-28T23:28:29.000Z\n",
      "--------------------\n",
      "44\n",
      "Tweet id: 1828937719084659057\n",
      "Created at: 2024-08-28T23:28:26.000Z\n",
      "--------------------\n",
      "45\n",
      "Tweet id: 1828937706254278869\n",
      "Created at: 2024-08-28T23:28:23.000Z\n",
      "--------------------\n",
      "46\n",
      "Tweet id: 1828937685752500421\n",
      "Created at: 2024-08-28T23:28:18.000Z\n",
      "--------------------\n",
      "47\n",
      "Tweet id: 1828937659177414767\n",
      "Created at: 2024-08-28T23:28:12.000Z\n",
      "--------------------\n",
      "48\n",
      "Tweet id: 1828937658648932674\n",
      "Created at: 2024-08-28T23:28:12.000Z\n",
      "--------------------\n",
      "49\n",
      "Tweet id: 1828937645973745728\n",
      "Created at: 2024-08-28T23:28:09.000Z\n",
      "--------------------\n",
      "50\n",
      "Tweet id: 1828937617821610495\n",
      "Created at: 2024-08-28T23:28:02.000Z\n",
      "--------------------\n",
      "51\n",
      "Tweet id: 1828937616311664834\n",
      "Created at: 2024-08-28T23:28:02.000Z\n",
      "--------------------\n",
      "52\n",
      "Tweet id: 1828937607545532631\n",
      "Created at: 2024-08-28T23:28:00.000Z\n",
      "--------------------\n",
      "53\n",
      "Tweet id: 1828937568500756917\n",
      "Created at: 2024-08-28T23:27:51.000Z\n",
      "--------------------\n",
      "54\n",
      "Tweet id: 1828937567485747322\n",
      "Created at: 2024-08-28T23:27:50.000Z\n",
      "--------------------\n",
      "55\n",
      "Tweet id: 1828937565656973336\n",
      "Created at: 2024-08-28T23:27:50.000Z\n",
      "--------------------\n",
      "56\n",
      "Tweet id: 1828937550767300642\n",
      "Created at: 2024-08-28T23:27:46.000Z\n",
      "--------------------\n",
      "57\n",
      "Tweet id: 1828937546388119918\n",
      "Created at: 2024-08-28T23:27:45.000Z\n",
      "--------------------\n",
      "58\n",
      "Tweet id: 1828937532161290344\n",
      "Created at: 2024-08-28T23:27:42.000Z\n",
      "--------------------\n",
      "59\n",
      "Tweet id: 1828937518735339667\n",
      "Created at: 2024-08-28T23:27:39.000Z\n",
      "--------------------\n",
      "60\n",
      "Tweet id: 1828937513970372775\n",
      "Created at: 2024-08-28T23:27:38.000Z\n",
      "--------------------\n",
      "61\n",
      "Tweet id: 1828937495083659766\n",
      "Created at: 2024-08-28T23:27:33.000Z\n",
      "--------------------\n",
      "62\n",
      "Tweet id: 1828937493233971338\n",
      "Created at: 2024-08-28T23:27:33.000Z\n",
      "--------------------\n",
      "63\n",
      "Tweet id: 1828937486195671547\n",
      "Created at: 2024-08-28T23:27:31.000Z\n",
      "--------------------\n",
      "64\n",
      "Tweet id: 1828937484719534311\n",
      "Created at: 2024-08-28T23:27:31.000Z\n",
      "--------------------\n",
      "65\n",
      "Tweet id: 1828937481464565967\n",
      "Created at: 2024-08-28T23:27:30.000Z\n",
      "--------------------\n",
      "66\n",
      "Tweet id: 1828937475512827977\n",
      "Created at: 2024-08-28T23:27:28.000Z\n",
      "--------------------\n",
      "67\n",
      "Tweet id: 1828937468470530195\n",
      "Created at: 2024-08-28T23:27:27.000Z\n",
      "--------------------\n",
      "68\n",
      "Tweet id: 1828937442138914898\n",
      "Created at: 2024-08-28T23:27:20.000Z\n",
      "--------------------\n",
      "69\n",
      "Tweet id: 1828937435293856052\n",
      "Created at: 2024-08-28T23:27:19.000Z\n",
      "--------------------\n",
      "70\n",
      "Tweet id: 1828937433687486619\n",
      "Created at: 2024-08-28T23:27:18.000Z\n",
      "--------------------\n",
      "71\n",
      "Tweet id: 1828937401802113214\n",
      "Created at: 2024-08-28T23:27:11.000Z\n",
      "--------------------\n",
      "72\n",
      "Tweet id: 1828937394697236661\n",
      "Created at: 2024-08-28T23:27:09.000Z\n",
      "--------------------\n",
      "73\n",
      "Tweet id: 1828937390205124640\n",
      "Created at: 2024-08-28T23:27:08.000Z\n",
      "--------------------\n",
      "74\n",
      "Tweet id: 1828937382676271525\n",
      "Created at: 2024-08-28T23:27:06.000Z\n",
      "--------------------\n",
      "75\n",
      "Tweet id: 1828937376737214762\n",
      "Created at: 2024-08-28T23:27:05.000Z\n",
      "--------------------\n",
      "76\n",
      "Tweet id: 1828937367149011389\n",
      "Created at: 2024-08-28T23:27:02.000Z\n",
      "--------------------\n",
      "77\n",
      "Tweet id: 1828937359406322045\n",
      "Created at: 2024-08-28T23:27:01.000Z\n",
      "--------------------\n",
      "78\n",
      "Tweet id: 1828937343996441081\n",
      "Created at: 2024-08-28T23:26:57.000Z\n",
      "--------------------\n",
      "79\n",
      "Tweet id: 1828937338338377875\n",
      "Created at: 2024-08-28T23:26:56.000Z\n",
      "--------------------\n",
      "80\n",
      "Tweet id: 1828937331635827105\n",
      "Created at: 2024-08-28T23:26:54.000Z\n",
      "--------------------\n",
      "81\n",
      "Tweet id: 1828937327919411511\n",
      "Created at: 2024-08-28T23:26:53.000Z\n",
      "--------------------\n",
      "82\n",
      "Tweet id: 1828937327659626618\n",
      "Created at: 2024-08-28T23:26:53.000Z\n",
      "--------------------\n",
      "83\n",
      "Tweet id: 1828937287163691070\n",
      "Created at: 2024-08-28T23:26:43.000Z\n",
      "--------------------\n",
      "84\n",
      "Tweet id: 1828937284697383332\n",
      "Created at: 2024-08-28T23:26:43.000Z\n",
      "--------------------\n",
      "85\n",
      "Tweet id: 1828937273326612857\n",
      "Created at: 2024-08-28T23:26:40.000Z\n",
      "--------------------\n",
      "86\n",
      "Tweet id: 1828937259556712522\n",
      "Created at: 2024-08-28T23:26:37.000Z\n",
      "--------------------\n",
      "87\n",
      "Tweet id: 1828937254250635625\n",
      "Created at: 2024-08-28T23:26:36.000Z\n",
      "--------------------\n",
      "88\n",
      "Tweet id: 1828937247338418474\n",
      "Created at: 2024-08-28T23:26:34.000Z\n",
      "--------------------\n",
      "89\n",
      "Tweet id: 1828937244562137481\n",
      "Created at: 2024-08-28T23:26:33.000Z\n",
      "--------------------\n",
      "90\n",
      "Tweet id: 1828937243198927120\n",
      "Created at: 2024-08-28T23:26:33.000Z\n",
      "--------------------\n",
      "91\n",
      "Tweet id: 1828937239600226807\n",
      "Created at: 2024-08-28T23:26:32.000Z\n",
      "--------------------\n",
      "92\n",
      "Tweet id: 1828937209451291022\n",
      "Created at: 2024-08-28T23:26:25.000Z\n",
      "--------------------\n",
      "93\n",
      "Tweet id: 1828937192749838547\n",
      "Created at: 2024-08-28T23:26:21.000Z\n",
      "--------------------\n",
      "94\n",
      "Tweet id: 1828937184382201987\n",
      "Created at: 2024-08-28T23:26:19.000Z\n",
      "--------------------\n",
      "95\n",
      "Tweet id: 1828937176236863805\n",
      "Created at: 2024-08-28T23:26:17.000Z\n",
      "--------------------\n",
      "96\n",
      "Tweet id: 1828937174336819486\n",
      "Created at: 2024-08-28T23:26:17.000Z\n",
      "--------------------\n",
      "97\n",
      "Tweet id: 1828937168750063666\n",
      "Created at: 2024-08-28T23:26:15.000Z\n",
      "--------------------\n",
      "98\n",
      "Tweet id: 1828937161003151505\n",
      "Created at: 2024-08-28T23:26:13.000Z\n",
      "--------------------\n",
      "99\n",
      "Tweet id: 1828937148378296451\n",
      "Created at: 2024-08-28T23:26:10.000Z\n",
      "--------------------\n",
      "100\n",
      "Tweet id: 1828937125750026249\n",
      "Created at: 2024-08-28T23:26:05.000Z\n",
      "--------------------\n",
      "2024-08-28T23:40:00Z\n",
      "1\n",
      "Tweet id: 1828940626034872642\n",
      "Created at: 2024-08-28T23:39:59.000Z\n",
      "--------------------\n",
      "2\n",
      "Tweet id: 1828940613464608978\n",
      "Created at: 2024-08-28T23:39:56.000Z\n",
      "--------------------\n",
      "3\n",
      "Tweet id: 1828940604799127816\n",
      "Created at: 2024-08-28T23:39:54.000Z\n",
      "--------------------\n",
      "4\n",
      "Tweet id: 1828940593289974209\n",
      "Created at: 2024-08-28T23:39:52.000Z\n",
      "--------------------\n",
      "5\n",
      "Tweet id: 1828940570305171496\n",
      "Created at: 2024-08-28T23:39:46.000Z\n",
      "--------------------\n",
      "6\n",
      "Tweet id: 1828940529931067897\n",
      "Created at: 2024-08-28T23:39:37.000Z\n",
      "--------------------\n",
      "7\n",
      "Tweet id: 1828940469147165138\n",
      "Created at: 2024-08-28T23:39:22.000Z\n",
      "--------------------\n",
      "8\n",
      "Tweet id: 1828940440097137049\n",
      "Created at: 2024-08-28T23:39:15.000Z\n",
      "--------------------\n",
      "9\n",
      "Tweet id: 1828940421676040654\n",
      "Created at: 2024-08-28T23:39:11.000Z\n",
      "--------------------\n",
      "10\n",
      "Tweet id: 1828940416273789030\n",
      "Created at: 2024-08-28T23:39:09.000Z\n",
      "--------------------\n",
      "11\n",
      "Tweet id: 1828940405087580634\n",
      "Created at: 2024-08-28T23:39:07.000Z\n",
      "--------------------\n",
      "12\n",
      "Tweet id: 1828940389379920311\n",
      "Created at: 2024-08-28T23:39:03.000Z\n",
      "--------------------\n",
      "13\n",
      "Tweet id: 1828940377576833453\n",
      "Created at: 2024-08-28T23:39:00.000Z\n",
      "--------------------\n",
      "14\n",
      "Tweet id: 1828940361403973655\n",
      "Created at: 2024-08-28T23:38:56.000Z\n",
      "--------------------\n",
      "15\n",
      "Tweet id: 1828940347109732834\n",
      "Created at: 2024-08-28T23:38:53.000Z\n",
      "--------------------\n",
      "16\n",
      "Tweet id: 1828940335415755089\n",
      "Created at: 2024-08-28T23:38:50.000Z\n",
      "--------------------\n",
      "17\n",
      "Tweet id: 1828940316101226845\n",
      "Created at: 2024-08-28T23:38:46.000Z\n",
      "--------------------\n",
      "18\n",
      "Tweet id: 1828940314587111782\n",
      "Created at: 2024-08-28T23:38:45.000Z\n",
      "--------------------\n",
      "19\n",
      "Tweet id: 1828940309033824510\n",
      "Created at: 2024-08-28T23:38:44.000Z\n",
      "--------------------\n",
      "20\n",
      "Tweet id: 1828940302993756329\n",
      "Created at: 2024-08-28T23:38:42.000Z\n",
      "--------------------\n",
      "21\n",
      "Tweet id: 1828940251886432374\n",
      "Created at: 2024-08-28T23:38:30.000Z\n",
      "--------------------\n",
      "22\n",
      "Tweet id: 1828940249654792565\n",
      "Created at: 2024-08-28T23:38:30.000Z\n",
      "--------------------\n",
      "23\n",
      "Tweet id: 1828940229086196164\n",
      "Created at: 2024-08-28T23:38:25.000Z\n",
      "--------------------\n",
      "24\n",
      "Tweet id: 1828940223742652738\n",
      "Created at: 2024-08-28T23:38:24.000Z\n",
      "--------------------\n",
      "25\n",
      "Tweet id: 1828940212044476884\n",
      "Created at: 2024-08-28T23:38:21.000Z\n",
      "--------------------\n",
      "26\n",
      "Tweet id: 1828940204977385857\n",
      "Created at: 2024-08-28T23:38:19.000Z\n",
      "--------------------\n",
      "27\n",
      "Tweet id: 1828940199063368180\n",
      "Created at: 2024-08-28T23:38:18.000Z\n",
      "--------------------\n",
      "28\n",
      "Tweet id: 1828940197113057754\n",
      "Created at: 2024-08-28T23:38:17.000Z\n",
      "--------------------\n",
      "29\n",
      "Tweet id: 1828940178473529554\n",
      "Created at: 2024-08-28T23:38:13.000Z\n",
      "--------------------\n",
      "30\n",
      "Tweet id: 1828940148517810226\n",
      "Created at: 2024-08-28T23:38:06.000Z\n",
      "--------------------\n",
      "31\n",
      "Tweet id: 1828940138908659838\n",
      "Created at: 2024-08-28T23:38:03.000Z\n",
      "--------------------\n",
      "32\n",
      "Tweet id: 1828940138740605034\n",
      "Created at: 2024-08-28T23:38:03.000Z\n",
      "--------------------\n",
      "33\n",
      "Tweet id: 1828940138694750434\n",
      "Created at: 2024-08-28T23:38:03.000Z\n",
      "--------------------\n",
      "34\n",
      "Tweet id: 1828940136450560075\n",
      "Created at: 2024-08-28T23:38:03.000Z\n",
      "--------------------\n",
      "35\n",
      "Tweet id: 1828940132898222136\n",
      "Created at: 2024-08-28T23:38:02.000Z\n",
      "--------------------\n",
      "36\n",
      "Tweet id: 1828940124484157910\n",
      "Created at: 2024-08-28T23:38:00.000Z\n",
      "--------------------\n",
      "37\n",
      "Tweet id: 1828940118658290136\n",
      "Created at: 2024-08-28T23:37:59.000Z\n",
      "--------------------\n",
      "38\n",
      "Tweet id: 1828940114774634534\n",
      "Created at: 2024-08-28T23:37:58.000Z\n",
      "--------------------\n",
      "39\n",
      "Tweet id: 1828940094570672314\n",
      "Created at: 2024-08-28T23:37:53.000Z\n",
      "--------------------\n",
      "40\n",
      "Tweet id: 1828940078954979440\n",
      "Created at: 2024-08-28T23:37:49.000Z\n",
      "--------------------\n",
      "41\n",
      "Tweet id: 1828940074332860855\n",
      "Created at: 2024-08-28T23:37:48.000Z\n",
      "--------------------\n",
      "42\n",
      "Tweet id: 1828940070335758371\n",
      "Created at: 2024-08-28T23:37:47.000Z\n",
      "--------------------\n",
      "43\n",
      "Tweet id: 1828940034164306425\n",
      "Created at: 2024-08-28T23:37:38.000Z\n",
      "--------------------\n",
      "44\n",
      "Tweet id: 1828940027960647749\n",
      "Created at: 2024-08-28T23:37:37.000Z\n",
      "--------------------\n",
      "45\n",
      "Tweet id: 1828940023762432256\n",
      "Created at: 2024-08-28T23:37:36.000Z\n",
      "--------------------\n",
      "46\n",
      "Tweet id: 1828940005974388772\n",
      "Created at: 2024-08-28T23:37:32.000Z\n",
      "--------------------\n",
      "47\n",
      "Tweet id: 1828939988152791051\n",
      "Created at: 2024-08-28T23:37:27.000Z\n",
      "--------------------\n",
      "48\n",
      "Tweet id: 1828939982251405568\n",
      "Created at: 2024-08-28T23:37:26.000Z\n",
      "--------------------\n",
      "49\n",
      "Tweet id: 1828939949972041936\n",
      "Created at: 2024-08-28T23:37:18.000Z\n",
      "--------------------\n",
      "50\n",
      "Tweet id: 1828939949581947356\n",
      "Created at: 2024-08-28T23:37:18.000Z\n",
      "--------------------\n",
      "51\n",
      "Tweet id: 1828939943722320357\n",
      "Created at: 2024-08-28T23:37:17.000Z\n",
      "--------------------\n",
      "52\n",
      "Tweet id: 1828939926898954609\n",
      "Created at: 2024-08-28T23:37:13.000Z\n",
      "--------------------\n",
      "53\n",
      "Tweet id: 1828939917134835790\n",
      "Created at: 2024-08-28T23:37:10.000Z\n",
      "--------------------\n",
      "54\n",
      "Tweet id: 1828939907420586188\n",
      "Created at: 2024-08-28T23:37:08.000Z\n",
      "--------------------\n",
      "55\n",
      "Tweet id: 1828939907395661893\n",
      "Created at: 2024-08-28T23:37:08.000Z\n",
      "--------------------\n",
      "56\n",
      "Tweet id: 1828939882011505144\n",
      "Created at: 2024-08-28T23:37:02.000Z\n",
      "--------------------\n",
      "57\n",
      "Tweet id: 1828939879251906610\n",
      "Created at: 2024-08-28T23:37:01.000Z\n",
      "--------------------\n",
      "58\n",
      "Tweet id: 1828939862625661024\n",
      "Created at: 2024-08-28T23:36:57.000Z\n",
      "--------------------\n",
      "59\n",
      "Tweet id: 1828939862013030415\n",
      "Created at: 2024-08-28T23:36:57.000Z\n",
      "--------------------\n",
      "60\n",
      "Tweet id: 1828939844099408376\n",
      "Created at: 2024-08-28T23:36:53.000Z\n",
      "--------------------\n",
      "61\n",
      "Tweet id: 1828939834326765568\n",
      "Created at: 2024-08-28T23:36:51.000Z\n",
      "--------------------\n",
      "62\n",
      "Tweet id: 1828939798179983553\n",
      "Created at: 2024-08-28T23:36:42.000Z\n",
      "--------------------\n",
      "63\n",
      "Tweet id: 1828939793616482738\n",
      "Created at: 2024-08-28T23:36:41.000Z\n",
      "--------------------\n",
      "64\n",
      "Tweet id: 1828939786335465587\n",
      "Created at: 2024-08-28T23:36:39.000Z\n",
      "--------------------\n",
      "65\n",
      "Tweet id: 1828939752541958509\n",
      "Created at: 2024-08-28T23:36:31.000Z\n",
      "--------------------\n",
      "66\n",
      "Tweet id: 1828939744882872320\n",
      "Created at: 2024-08-28T23:36:29.000Z\n",
      "--------------------\n",
      "67\n",
      "Tweet id: 1828939687714496735\n",
      "Created at: 2024-08-28T23:36:16.000Z\n",
      "--------------------\n",
      "68\n",
      "Tweet id: 1828939677531025519\n",
      "Created at: 2024-08-28T23:36:13.000Z\n",
      "--------------------\n",
      "69\n",
      "Tweet id: 1828939664541266294\n",
      "Created at: 2024-08-28T23:36:10.000Z\n",
      "--------------------\n",
      "70\n",
      "Tweet id: 1828939645310382204\n",
      "Created at: 2024-08-28T23:36:06.000Z\n",
      "--------------------\n",
      "71\n",
      "Tweet id: 1828939642290479582\n",
      "Created at: 2024-08-28T23:36:05.000Z\n",
      "--------------------\n",
      "72\n",
      "Tweet id: 1828939639287349309\n",
      "Created at: 2024-08-28T23:36:04.000Z\n",
      "--------------------\n",
      "73\n",
      "Tweet id: 1828939607796527386\n",
      "Created at: 2024-08-28T23:35:57.000Z\n",
      "--------------------\n",
      "74\n",
      "Tweet id: 1828939605636460560\n",
      "Created at: 2024-08-28T23:35:56.000Z\n",
      "--------------------\n",
      "75\n",
      "Tweet id: 1828939591136481676\n",
      "Created at: 2024-08-28T23:35:53.000Z\n",
      "--------------------\n",
      "76\n",
      "Tweet id: 1828939576422928641\n",
      "Created at: 2024-08-28T23:35:49.000Z\n",
      "--------------------\n",
      "77\n",
      "Tweet id: 1828939574699000068\n",
      "Created at: 2024-08-28T23:35:49.000Z\n",
      "--------------------\n",
      "78\n",
      "Tweet id: 1828939527064375464\n",
      "Created at: 2024-08-28T23:35:37.000Z\n",
      "--------------------\n",
      "79\n",
      "Tweet id: 1828939525391057361\n",
      "Created at: 2024-08-28T23:35:37.000Z\n",
      "--------------------\n",
      "80\n",
      "Tweet id: 1828939520265380127\n",
      "Created at: 2024-08-28T23:35:36.000Z\n",
      "--------------------\n",
      "81\n",
      "Tweet id: 1828939501957456345\n",
      "Created at: 2024-08-28T23:35:31.000Z\n",
      "--------------------\n",
      "82\n",
      "Tweet id: 1828939499696459988\n",
      "Created at: 2024-08-28T23:35:31.000Z\n",
      "--------------------\n",
      "83\n",
      "Tweet id: 1828939473574416487\n",
      "Created at: 2024-08-28T23:35:25.000Z\n",
      "--------------------\n",
      "84\n",
      "Tweet id: 1828939465328677142\n",
      "Created at: 2024-08-28T23:35:23.000Z\n",
      "--------------------\n",
      "85\n",
      "Tweet id: 1828939464841822593\n",
      "Created at: 2024-08-28T23:35:23.000Z\n",
      "--------------------\n",
      "86\n",
      "Tweet id: 1828939417467150387\n",
      "Created at: 2024-08-28T23:35:11.000Z\n",
      "--------------------\n",
      "87\n",
      "Tweet id: 1828939415114199076\n",
      "Created at: 2024-08-28T23:35:11.000Z\n",
      "--------------------\n",
      "88\n",
      "Tweet id: 1828939407958679864\n",
      "Created at: 2024-08-28T23:35:09.000Z\n",
      "--------------------\n",
      "89\n",
      "Tweet id: 1828939384953155723\n",
      "Created at: 2024-08-28T23:35:04.000Z\n",
      "--------------------\n",
      "90\n",
      "Tweet id: 1828939369383899363\n",
      "Created at: 2024-08-28T23:35:00.000Z\n",
      "--------------------\n",
      "91\n",
      "Tweet id: 1828939330708275265\n",
      "Created at: 2024-08-28T23:34:51.000Z\n",
      "--------------------\n",
      "92\n",
      "Tweet id: 1828939309736755539\n",
      "Created at: 2024-08-28T23:34:46.000Z\n",
      "--------------------\n",
      "93\n",
      "Tweet id: 1828939296268570791\n",
      "Created at: 2024-08-28T23:34:42.000Z\n",
      "--------------------\n",
      "94\n",
      "Tweet id: 1828939293215338878\n",
      "Created at: 2024-08-28T23:34:42.000Z\n",
      "--------------------\n",
      "95\n",
      "Tweet id: 1828939282486051181\n",
      "Created at: 2024-08-28T23:34:39.000Z\n",
      "--------------------\n",
      "96\n",
      "Tweet id: 1828939263205093679\n",
      "Created at: 2024-08-28T23:34:35.000Z\n",
      "--------------------\n",
      "97\n",
      "Tweet id: 1828939241201512718\n",
      "Created at: 2024-08-28T23:34:29.000Z\n",
      "--------------------\n",
      "98\n",
      "Tweet id: 1828939214471475392\n",
      "Created at: 2024-08-28T23:34:23.000Z\n",
      "--------------------\n",
      "99\n",
      "Tweet id: 1828939214379209197\n",
      "Created at: 2024-08-28T23:34:23.000Z\n",
      "--------------------\n",
      "100\n",
      "Tweet id: 1828939207047627232\n",
      "Created at: 2024-08-28T23:34:21.000Z\n",
      "--------------------\n",
      "2024-08-28T23:50:00Z\n",
      "1\n",
      "Tweet id: 1828943139387883549\n",
      "Created at: 2024-08-28T23:49:59.000Z\n",
      "--------------------\n",
      "2\n",
      "Tweet id: 1828943131594883213\n",
      "Created at: 2024-08-28T23:49:57.000Z\n",
      "--------------------\n",
      "3\n",
      "Tweet id: 1828943103560167872\n",
      "Created at: 2024-08-28T23:49:50.000Z\n",
      "--------------------\n",
      "4\n",
      "Tweet id: 1828943066767769788\n",
      "Created at: 2024-08-28T23:49:41.000Z\n",
      "--------------------\n",
      "5\n",
      "Tweet id: 1828943061826797611\n",
      "Created at: 2024-08-28T23:49:40.000Z\n",
      "--------------------\n",
      "6\n",
      "Tweet id: 1828943052951748763\n",
      "Created at: 2024-08-28T23:49:38.000Z\n",
      "--------------------\n",
      "7\n",
      "Tweet id: 1828943033121091959\n",
      "Created at: 2024-08-28T23:49:33.000Z\n",
      "--------------------\n",
      "8\n",
      "Tweet id: 1828942984039317714\n",
      "Created at: 2024-08-28T23:49:22.000Z\n",
      "--------------------\n",
      "9\n",
      "Tweet id: 1828942955568345193\n",
      "Created at: 2024-08-28T23:49:15.000Z\n",
      "--------------------\n",
      "10\n",
      "Tweet id: 1828942942733775245\n",
      "Created at: 2024-08-28T23:49:12.000Z\n",
      "--------------------\n",
      "11\n",
      "Tweet id: 1828942933841818073\n",
      "Created at: 2024-08-28T23:49:10.000Z\n",
      "--------------------\n",
      "12\n",
      "Tweet id: 1828942923020533998\n",
      "Created at: 2024-08-28T23:49:07.000Z\n",
      "--------------------\n",
      "13\n",
      "Tweet id: 1828942913155543327\n",
      "Created at: 2024-08-28T23:49:05.000Z\n",
      "--------------------\n",
      "14\n",
      "Tweet id: 1828942909057741286\n",
      "Created at: 2024-08-28T23:49:04.000Z\n",
      "--------------------\n",
      "15\n",
      "Tweet id: 1828942898563559527\n",
      "Created at: 2024-08-28T23:49:01.000Z\n",
      "--------------------\n",
      "16\n",
      "Tweet id: 1828942876299890744\n",
      "Created at: 2024-08-28T23:48:56.000Z\n",
      "--------------------\n",
      "17\n",
      "Tweet id: 1828942864967184694\n",
      "Created at: 2024-08-28T23:48:53.000Z\n",
      "--------------------\n",
      "18\n",
      "Tweet id: 1828942857639510234\n",
      "Created at: 2024-08-28T23:48:52.000Z\n",
      "--------------------\n",
      "19\n",
      "Tweet id: 1828942841982177507\n",
      "Created at: 2024-08-28T23:48:48.000Z\n",
      "--------------------\n",
      "20\n",
      "Tweet id: 1828942819949719664\n",
      "Created at: 2024-08-28T23:48:43.000Z\n",
      "--------------------\n",
      "21\n",
      "Tweet id: 1828942799502463412\n",
      "Created at: 2024-08-28T23:48:38.000Z\n",
      "--------------------\n",
      "22\n",
      "Tweet id: 1828942795337576648\n",
      "Created at: 2024-08-28T23:48:37.000Z\n",
      "--------------------\n",
      "23\n",
      "Tweet id: 1828942786642751658\n",
      "Created at: 2024-08-28T23:48:35.000Z\n",
      "--------------------\n",
      "24\n",
      "Tweet id: 1828942779864756511\n",
      "Created at: 2024-08-28T23:48:33.000Z\n",
      "--------------------\n",
      "25\n",
      "Tweet id: 1828942733479989332\n",
      "Created at: 2024-08-28T23:48:22.000Z\n",
      "--------------------\n",
      "26\n",
      "Tweet id: 1828942721236775369\n",
      "Created at: 2024-08-28T23:48:19.000Z\n",
      "--------------------\n",
      "27\n",
      "Tweet id: 1828942702630895855\n",
      "Created at: 2024-08-28T23:48:15.000Z\n",
      "--------------------\n",
      "28\n",
      "Tweet id: 1828942697652203554\n",
      "Created at: 2024-08-28T23:48:13.000Z\n",
      "--------------------\n",
      "29\n",
      "Tweet id: 1828942682825338917\n",
      "Created at: 2024-08-28T23:48:10.000Z\n",
      "--------------------\n",
      "30\n",
      "Tweet id: 1828942681055343101\n",
      "Created at: 2024-08-28T23:48:09.000Z\n",
      "--------------------\n",
      "31\n",
      "Tweet id: 1828942666903818441\n",
      "Created at: 2024-08-28T23:48:06.000Z\n",
      "--------------------\n",
      "32\n",
      "Tweet id: 1828942664735007079\n",
      "Created at: 2024-08-28T23:48:06.000Z\n",
      "--------------------\n",
      "33\n",
      "Tweet id: 1828942658032763143\n",
      "Created at: 2024-08-28T23:48:04.000Z\n",
      "--------------------\n",
      "34\n",
      "Tweet id: 1828942622548762785\n",
      "Created at: 2024-08-28T23:47:55.000Z\n",
      "--------------------\n",
      "35\n",
      "Tweet id: 1828942615733297598\n",
      "Created at: 2024-08-28T23:47:54.000Z\n",
      "--------------------\n",
      "36\n",
      "Tweet id: 1828942609605374422\n",
      "Created at: 2024-08-28T23:47:52.000Z\n",
      "--------------------\n",
      "37\n",
      "Tweet id: 1828942595235705038\n",
      "Created at: 2024-08-28T23:47:49.000Z\n",
      "--------------------\n",
      "38\n",
      "Tweet id: 1828942586419261636\n",
      "Created at: 2024-08-28T23:47:47.000Z\n",
      "--------------------\n",
      "39\n",
      "Tweet id: 1828942536830050434\n",
      "Created at: 2024-08-28T23:47:35.000Z\n",
      "--------------------\n",
      "40\n",
      "Tweet id: 1828942526792835474\n",
      "Created at: 2024-08-28T23:47:33.000Z\n",
      "--------------------\n",
      "41\n",
      "Tweet id: 1828942464704827592\n",
      "Created at: 2024-08-28T23:47:18.000Z\n",
      "--------------------\n",
      "42\n",
      "Tweet id: 1828942451094237469\n",
      "Created at: 2024-08-28T23:47:15.000Z\n",
      "--------------------\n",
      "43\n",
      "Tweet id: 1828942434191003933\n",
      "Created at: 2024-08-28T23:47:11.000Z\n",
      "--------------------\n",
      "44\n",
      "Tweet id: 1828942411684557222\n",
      "Created at: 2024-08-28T23:47:05.000Z\n",
      "--------------------\n",
      "45\n",
      "Tweet id: 1828942409822278095\n",
      "Created at: 2024-08-28T23:47:05.000Z\n",
      "--------------------\n",
      "46\n",
      "Tweet id: 1828942385369235704\n",
      "Created at: 2024-08-28T23:46:59.000Z\n",
      "--------------------\n",
      "47\n",
      "Tweet id: 1828942363810734251\n",
      "Created at: 2024-08-28T23:46:54.000Z\n",
      "--------------------\n",
      "48\n",
      "Tweet id: 1828942315571785765\n",
      "Created at: 2024-08-28T23:46:42.000Z\n",
      "--------------------\n",
      "49\n",
      "Tweet id: 1828942311914647552\n",
      "Created at: 2024-08-28T23:46:41.000Z\n",
      "--------------------\n",
      "50\n",
      "Tweet id: 1828942251193475501\n",
      "Created at: 2024-08-28T23:46:27.000Z\n",
      "--------------------\n",
      "51\n",
      "Tweet id: 1828942248563671104\n",
      "Created at: 2024-08-28T23:46:26.000Z\n",
      "--------------------\n",
      "52\n",
      "Tweet id: 1828942234890182987\n",
      "Created at: 2024-08-28T23:46:23.000Z\n",
      "--------------------\n",
      "53\n",
      "Tweet id: 1828942165969449449\n",
      "Created at: 2024-08-28T23:46:07.000Z\n",
      "--------------------\n",
      "54\n",
      "Tweet id: 1828942155798458544\n",
      "Created at: 2024-08-28T23:46:04.000Z\n",
      "--------------------\n",
      "55\n",
      "Tweet id: 1828942132805267960\n",
      "Created at: 2024-08-28T23:45:59.000Z\n",
      "--------------------\n",
      "56\n",
      "Tweet id: 1828942117340659992\n",
      "Created at: 2024-08-28T23:45:55.000Z\n",
      "--------------------\n",
      "57\n",
      "Tweet id: 1828942096377753990\n",
      "Created at: 2024-08-28T23:45:50.000Z\n",
      "--------------------\n",
      "58\n",
      "Tweet id: 1828942077448581305\n",
      "Created at: 2024-08-28T23:45:46.000Z\n",
      "--------------------\n",
      "59\n",
      "Tweet id: 1828942073359454301\n",
      "Created at: 2024-08-28T23:45:45.000Z\n",
      "--------------------\n",
      "60\n",
      "Tweet id: 1828941995899007013\n",
      "Created at: 2024-08-28T23:45:26.000Z\n",
      "--------------------\n",
      "61\n",
      "Tweet id: 1828941992237396162\n",
      "Created at: 2024-08-28T23:45:25.000Z\n",
      "--------------------\n",
      "62\n",
      "Tweet id: 1828941965750321550\n",
      "Created at: 2024-08-28T23:45:19.000Z\n",
      "--------------------\n",
      "63\n",
      "Tweet id: 1828941962927645104\n",
      "Created at: 2024-08-28T23:45:18.000Z\n",
      "--------------------\n",
      "64\n",
      "Tweet id: 1828941952915804174\n",
      "Created at: 2024-08-28T23:45:16.000Z\n",
      "--------------------\n",
      "65\n",
      "Tweet id: 1828941944904659407\n",
      "Created at: 2024-08-28T23:45:14.000Z\n",
      "--------------------\n",
      "66\n",
      "Tweet id: 1828941926919528926\n",
      "Created at: 2024-08-28T23:45:10.000Z\n",
      "--------------------\n",
      "67\n",
      "Tweet id: 1828941916622467537\n",
      "Created at: 2024-08-28T23:45:07.000Z\n",
      "--------------------\n",
      "68\n",
      "Tweet id: 1828941916341407957\n",
      "Created at: 2024-08-28T23:45:07.000Z\n",
      "--------------------\n",
      "69\n",
      "Tweet id: 1828941910716887521\n",
      "Created at: 2024-08-28T23:45:06.000Z\n",
      "--------------------\n",
      "70\n",
      "Tweet id: 1828941906396754284\n",
      "Created at: 2024-08-28T23:45:05.000Z\n",
      "--------------------\n",
      "71\n",
      "Tweet id: 1828941903100076038\n",
      "Created at: 2024-08-28T23:45:04.000Z\n",
      "--------------------\n",
      "72\n",
      "Tweet id: 1828941878450082103\n",
      "Created at: 2024-08-28T23:44:58.000Z\n",
      "--------------------\n",
      "73\n",
      "Tweet id: 1828941849790427238\n",
      "Created at: 2024-08-28T23:44:51.000Z\n",
      "--------------------\n",
      "74\n",
      "Tweet id: 1828941844375286033\n",
      "Created at: 2024-08-28T23:44:50.000Z\n",
      "--------------------\n",
      "75\n",
      "Tweet id: 1828941834766242141\n",
      "Created at: 2024-08-28T23:44:48.000Z\n",
      "--------------------\n",
      "76\n",
      "Tweet id: 1828941821969608792\n",
      "Created at: 2024-08-28T23:44:45.000Z\n",
      "--------------------\n",
      "77\n",
      "Tweet id: 1828941793909715423\n",
      "Created at: 2024-08-28T23:44:38.000Z\n",
      "--------------------\n",
      "78\n",
      "Tweet id: 1828941753308819878\n",
      "Created at: 2024-08-28T23:44:28.000Z\n",
      "--------------------\n",
      "79\n",
      "Tweet id: 1828941753128497520\n",
      "Created at: 2024-08-28T23:44:28.000Z\n",
      "--------------------\n",
      "80\n",
      "Tweet id: 1828941742881800669\n",
      "Created at: 2024-08-28T23:44:26.000Z\n",
      "--------------------\n",
      "81\n",
      "Tweet id: 1828941719527985404\n",
      "Created at: 2024-08-28T23:44:20.000Z\n",
      "--------------------\n",
      "82\n",
      "Tweet id: 1828941706664034417\n",
      "Created at: 2024-08-28T23:44:17.000Z\n",
      "--------------------\n",
      "83\n",
      "Tweet id: 1828941680206086628\n",
      "Created at: 2024-08-28T23:44:11.000Z\n",
      "--------------------\n",
      "84\n",
      "Tweet id: 1828941679878877257\n",
      "Created at: 2024-08-28T23:44:11.000Z\n",
      "--------------------\n",
      "85\n",
      "Tweet id: 1828941677597470756\n",
      "Created at: 2024-08-28T23:44:10.000Z\n",
      "--------------------\n",
      "86\n",
      "Tweet id: 1828941662619611596\n",
      "Created at: 2024-08-28T23:44:07.000Z\n",
      "--------------------\n",
      "87\n",
      "Tweet id: 1828941610614436196\n",
      "Created at: 2024-08-28T23:43:54.000Z\n",
      "--------------------\n",
      "88\n",
      "Tweet id: 1828941595888234713\n",
      "Created at: 2024-08-28T23:43:51.000Z\n",
      "--------------------\n",
      "89\n",
      "Tweet id: 1828941593224557004\n",
      "Created at: 2024-08-28T23:43:50.000Z\n",
      "--------------------\n",
      "90\n",
      "Tweet id: 1828941591605621181\n",
      "Created at: 2024-08-28T23:43:50.000Z\n",
      "--------------------\n",
      "91\n",
      "Tweet id: 1828941554750247160\n",
      "Created at: 2024-08-28T23:43:41.000Z\n",
      "--------------------\n",
      "92\n",
      "Tweet id: 1828941522261393872\n",
      "Created at: 2024-08-28T23:43:33.000Z\n",
      "--------------------\n",
      "93\n",
      "Tweet id: 1828941505727287321\n",
      "Created at: 2024-08-28T23:43:29.000Z\n",
      "--------------------\n",
      "94\n",
      "Tweet id: 1828941474937090235\n",
      "Created at: 2024-08-28T23:43:22.000Z\n",
      "--------------------\n",
      "95\n",
      "Tweet id: 1828941458365145100\n",
      "Created at: 2024-08-28T23:43:18.000Z\n",
      "--------------------\n",
      "96\n",
      "Tweet id: 1828941456247279800\n",
      "Created at: 2024-08-28T23:43:17.000Z\n",
      "--------------------\n",
      "97\n",
      "Tweet id: 1828941450521768059\n",
      "Created at: 2024-08-28T23:43:16.000Z\n",
      "--------------------\n",
      "98\n",
      "Tweet id: 1828941447896420421\n",
      "Created at: 2024-08-28T23:43:15.000Z\n",
      "--------------------\n",
      "99\n",
      "Tweet id: 1828941426761314418\n",
      "Created at: 2024-08-28T23:43:10.000Z\n",
      "--------------------\n",
      "100\n",
      "Tweet id: 1828941405974343713\n",
      "Created at: 2024-08-28T23:43:05.000Z\n",
      "--------------------\n",
      "2024-08-29T00:00:00Z\n",
      "1\n",
      "Tweet id: 1828945595039658478\n",
      "Created at: 2024-08-28T23:59:44.000Z\n",
      "--------------------\n",
      "2\n",
      "Tweet id: 1828945594968355032\n",
      "Created at: 2024-08-28T23:59:44.000Z\n",
      "--------------------\n",
      "3\n",
      "Tweet id: 1828945593861058594\n",
      "Created at: 2024-08-28T23:59:44.000Z\n",
      "--------------------\n",
      "4\n",
      "Tweet id: 1828945568275542257\n",
      "Created at: 2024-08-28T23:59:38.000Z\n",
      "--------------------\n",
      "5\n",
      "Tweet id: 1828945555101495792\n",
      "Created at: 2024-08-28T23:59:35.000Z\n",
      "--------------------\n",
      "6\n",
      "Tweet id: 1828945545597161526\n",
      "Created at: 2024-08-28T23:59:32.000Z\n",
      "--------------------\n",
      "7\n",
      "Tweet id: 1828945533609881729\n",
      "Created at: 2024-08-28T23:59:30.000Z\n",
      "--------------------\n",
      "8\n",
      "Tweet id: 1828945508062351454\n",
      "Created at: 2024-08-28T23:59:23.000Z\n",
      "--------------------\n",
      "9\n",
      "Tweet id: 1828945484205199626\n",
      "Created at: 2024-08-28T23:59:18.000Z\n",
      "--------------------\n",
      "10\n",
      "Tweet id: 1828945479285023154\n",
      "Created at: 2024-08-28T23:59:17.000Z\n",
      "--------------------\n",
      "11\n",
      "Tweet id: 1828945476621840514\n",
      "Created at: 2024-08-28T23:59:16.000Z\n",
      "--------------------\n",
      "12\n",
      "Tweet id: 1828945454496887073\n",
      "Created at: 2024-08-28T23:59:11.000Z\n",
      "--------------------\n",
      "13\n",
      "Tweet id: 1828945396711993642\n",
      "Created at: 2024-08-28T23:58:57.000Z\n",
      "--------------------\n",
      "14\n",
      "Tweet id: 1828945392135979111\n",
      "Created at: 2024-08-28T23:58:56.000Z\n",
      "--------------------\n",
      "15\n",
      "Tweet id: 1828945349408378962\n",
      "Created at: 2024-08-28T23:58:46.000Z\n",
      "--------------------\n",
      "16\n",
      "Tweet id: 1828945334653067723\n",
      "Created at: 2024-08-28T23:58:42.000Z\n",
      "--------------------\n",
      "17\n",
      "Tweet id: 1828945332723491133\n",
      "Created at: 2024-08-28T23:58:42.000Z\n",
      "--------------------\n",
      "18\n",
      "Tweet id: 1828945321512054851\n",
      "Created at: 2024-08-28T23:58:39.000Z\n",
      "--------------------\n",
      "19\n",
      "Tweet id: 1828945317443846165\n",
      "Created at: 2024-08-28T23:58:38.000Z\n",
      "--------------------\n",
      "20\n",
      "Tweet id: 1828945301534863693\n",
      "Created at: 2024-08-28T23:58:34.000Z\n",
      "--------------------\n",
      "21\n",
      "Tweet id: 1828945301224247550\n",
      "Created at: 2024-08-28T23:58:34.000Z\n",
      "--------------------\n",
      "22\n",
      "Tweet id: 1828945292978257992\n",
      "Created at: 2024-08-28T23:58:32.000Z\n",
      "--------------------\n",
      "23\n",
      "Tweet id: 1828945263203102952\n",
      "Created at: 2024-08-28T23:58:25.000Z\n",
      "--------------------\n",
      "24\n",
      "Tweet id: 1828945241355002089\n",
      "Created at: 2024-08-28T23:58:20.000Z\n",
      "--------------------\n",
      "25\n",
      "Tweet id: 1828945241208143997\n",
      "Created at: 2024-08-28T23:58:20.000Z\n",
      "--------------------\n",
      "26\n",
      "Tweet id: 1828945230814687311\n",
      "Created at: 2024-08-28T23:58:17.000Z\n",
      "--------------------\n",
      "27\n",
      "Tweet id: 1828945211667673535\n",
      "Created at: 2024-08-28T23:58:13.000Z\n",
      "--------------------\n",
      "28\n",
      "Tweet id: 1828945204784898484\n",
      "Created at: 2024-08-28T23:58:11.000Z\n",
      "--------------------\n",
      "29\n",
      "Tweet id: 1828945200116601284\n",
      "Created at: 2024-08-28T23:58:10.000Z\n",
      "--------------------\n",
      "30\n",
      "Tweet id: 1828945177383424268\n",
      "Created at: 2024-08-28T23:58:05.000Z\n",
      "--------------------\n",
      "31\n",
      "Tweet id: 1828945153001971913\n",
      "Created at: 2024-08-28T23:57:59.000Z\n",
      "--------------------\n",
      "32\n",
      "Tweet id: 1828945152674803913\n",
      "Created at: 2024-08-28T23:57:59.000Z\n",
      "--------------------\n",
      "33\n",
      "Tweet id: 1828945123721523485\n",
      "Created at: 2024-08-28T23:57:52.000Z\n",
      "--------------------\n",
      "34\n",
      "Tweet id: 1828945112342364316\n",
      "Created at: 2024-08-28T23:57:49.000Z\n",
      "--------------------\n",
      "35\n",
      "Tweet id: 1828945100266672616\n",
      "Created at: 2024-08-28T23:57:46.000Z\n",
      "--------------------\n",
      "36\n",
      "Tweet id: 1828945074929185212\n",
      "Created at: 2024-08-28T23:57:40.000Z\n",
      "--------------------\n",
      "37\n",
      "Tweet id: 1828945067748254194\n",
      "Created at: 2024-08-28T23:57:38.000Z\n",
      "--------------------\n",
      "38\n",
      "Tweet id: 1828945046076604737\n",
      "Created at: 2024-08-28T23:57:33.000Z\n",
      "--------------------\n",
      "39\n",
      "Tweet id: 1828945004813000919\n",
      "Created at: 2024-08-28T23:57:23.000Z\n",
      "--------------------\n",
      "40\n",
      "Tweet id: 1828945002166399488\n",
      "Created at: 2024-08-28T23:57:23.000Z\n",
      "--------------------\n",
      "41\n",
      "Tweet id: 1828944994201157978\n",
      "Created at: 2024-08-28T23:57:21.000Z\n",
      "--------------------\n",
      "42\n",
      "Tweet id: 1828944979525255540\n",
      "Created at: 2024-08-28T23:57:17.000Z\n",
      "--------------------\n",
      "43\n",
      "Tweet id: 1828944960433123424\n",
      "Created at: 2024-08-28T23:57:13.000Z\n",
      "--------------------\n",
      "44\n",
      "Tweet id: 1828944941235744788\n",
      "Created at: 2024-08-28T23:57:08.000Z\n",
      "--------------------\n",
      "45\n",
      "Tweet id: 1828944935678292309\n",
      "Created at: 2024-08-28T23:57:07.000Z\n",
      "--------------------\n",
      "46\n",
      "Tweet id: 1828944926832521714\n",
      "Created at: 2024-08-28T23:57:05.000Z\n",
      "--------------------\n",
      "47\n",
      "Tweet id: 1828944925380977059\n",
      "Created at: 2024-08-28T23:57:05.000Z\n",
      "--------------------\n",
      "48\n",
      "Tweet id: 1828944909438750909\n",
      "Created at: 2024-08-28T23:57:01.000Z\n",
      "--------------------\n",
      "49\n",
      "Tweet id: 1828944898802004452\n",
      "Created at: 2024-08-28T23:56:58.000Z\n",
      "--------------------\n",
      "50\n",
      "Tweet id: 1828944844620022120\n",
      "Created at: 2024-08-28T23:56:45.000Z\n",
      "--------------------\n",
      "51\n",
      "Tweet id: 1828944828375171264\n",
      "Created at: 2024-08-28T23:56:41.000Z\n",
      "--------------------\n",
      "52\n",
      "Tweet id: 1828944822692131178\n",
      "Created at: 2024-08-28T23:56:40.000Z\n",
      "--------------------\n",
      "53\n",
      "Tweet id: 1828944813624045797\n",
      "Created at: 2024-08-28T23:56:38.000Z\n",
      "--------------------\n",
      "54\n",
      "Tweet id: 1828944781814190272\n",
      "Created at: 2024-08-28T23:56:30.000Z\n",
      "--------------------\n",
      "55\n",
      "Tweet id: 1828944769852068077\n",
      "Created at: 2024-08-28T23:56:27.000Z\n",
      "--------------------\n",
      "56\n",
      "Tweet id: 1828944725677879551\n",
      "Created at: 2024-08-28T23:56:17.000Z\n",
      "--------------------\n",
      "57\n",
      "Tweet id: 1828944691116814405\n",
      "Created at: 2024-08-28T23:56:09.000Z\n",
      "--------------------\n",
      "58\n",
      "Tweet id: 1828944690600960424\n",
      "Created at: 2024-08-28T23:56:09.000Z\n",
      "--------------------\n",
      "59\n",
      "Tweet id: 1828944677304971661\n",
      "Created at: 2024-08-28T23:56:05.000Z\n",
      "--------------------\n",
      "60\n",
      "Tweet id: 1828944674356375592\n",
      "Created at: 2024-08-28T23:56:05.000Z\n",
      "--------------------\n",
      "61\n",
      "Tweet id: 1828944622309257704\n",
      "Created at: 2024-08-28T23:55:52.000Z\n",
      "--------------------\n",
      "62\n",
      "Tweet id: 1828944581292884367\n",
      "Created at: 2024-08-28T23:55:42.000Z\n",
      "--------------------\n",
      "63\n",
      "Tweet id: 1828944564864135487\n",
      "Created at: 2024-08-28T23:55:39.000Z\n",
      "--------------------\n",
      "64\n",
      "Tweet id: 1828944560132895041\n",
      "Created at: 2024-08-28T23:55:37.000Z\n",
      "--------------------\n",
      "65\n",
      "Tweet id: 1828944556290724009\n",
      "Created at: 2024-08-28T23:55:37.000Z\n",
      "--------------------\n",
      "66\n",
      "Tweet id: 1828944552218226715\n",
      "Created at: 2024-08-28T23:55:36.000Z\n",
      "--------------------\n",
      "67\n",
      "Tweet id: 1828944545410887985\n",
      "Created at: 2024-08-28T23:55:34.000Z\n",
      "--------------------\n",
      "68\n",
      "Tweet id: 1828944533687775306\n",
      "Created at: 2024-08-28T23:55:31.000Z\n",
      "--------------------\n",
      "69\n",
      "Tweet id: 1828944513370583246\n",
      "Created at: 2024-08-28T23:55:26.000Z\n",
      "--------------------\n",
      "70\n",
      "Tweet id: 1828944504898167219\n",
      "Created at: 2024-08-28T23:55:24.000Z\n",
      "--------------------\n",
      "71\n",
      "Tweet id: 1828944462393028813\n",
      "Created at: 2024-08-28T23:55:14.000Z\n",
      "--------------------\n",
      "72\n",
      "Tweet id: 1828944460534936060\n",
      "Created at: 2024-08-28T23:55:14.000Z\n",
      "--------------------\n",
      "73\n",
      "Tweet id: 1828944460031607201\n",
      "Created at: 2024-08-28T23:55:14.000Z\n",
      "--------------------\n",
      "74\n",
      "Tweet id: 1828944430230868400\n",
      "Created at: 2024-08-28T23:55:06.000Z\n",
      "--------------------\n",
      "75\n",
      "Tweet id: 1828944419959255341\n",
      "Created at: 2024-08-28T23:55:04.000Z\n",
      "--------------------\n",
      "76\n",
      "Tweet id: 1828944414510579890\n",
      "Created at: 2024-08-28T23:55:03.000Z\n",
      "--------------------\n",
      "77\n",
      "Tweet id: 1828944405148877307\n",
      "Created at: 2024-08-28T23:55:00.000Z\n",
      "--------------------\n",
      "78\n",
      "Tweet id: 1828944367530455099\n",
      "Created at: 2024-08-28T23:54:52.000Z\n",
      "--------------------\n",
      "79\n",
      "Tweet id: 1828944345069912386\n",
      "Created at: 2024-08-28T23:54:46.000Z\n",
      "--------------------\n",
      "80\n",
      "Tweet id: 1828944336987521327\n",
      "Created at: 2024-08-28T23:54:44.000Z\n",
      "--------------------\n",
      "81\n",
      "Tweet id: 1828944331207782537\n",
      "Created at: 2024-08-28T23:54:43.000Z\n",
      "--------------------\n",
      "82\n",
      "Tweet id: 1828944307145060831\n",
      "Created at: 2024-08-28T23:54:37.000Z\n",
      "--------------------\n",
      "83\n",
      "Tweet id: 1828944267257012571\n",
      "Created at: 2024-08-28T23:54:28.000Z\n",
      "--------------------\n",
      "84\n",
      "Tweet id: 1828944244087660558\n",
      "Created at: 2024-08-28T23:54:22.000Z\n",
      "--------------------\n",
      "85\n",
      "Tweet id: 1828944225909498282\n",
      "Created at: 2024-08-28T23:54:18.000Z\n",
      "--------------------\n",
      "86\n",
      "Tweet id: 1828944186403639370\n",
      "Created at: 2024-08-28T23:54:08.000Z\n",
      "--------------------\n",
      "87\n",
      "Tweet id: 1828944180124467534\n",
      "Created at: 2024-08-28T23:54:07.000Z\n",
      "--------------------\n",
      "88\n",
      "Tweet id: 1828944143680520456\n",
      "Created at: 2024-08-28T23:53:58.000Z\n",
      "--------------------\n",
      "89\n",
      "Tweet id: 1828944126970355804\n",
      "Created at: 2024-08-28T23:53:54.000Z\n",
      "--------------------\n",
      "90\n",
      "Tweet id: 1828944107341000807\n",
      "Created at: 2024-08-28T23:53:49.000Z\n",
      "--------------------\n",
      "91\n",
      "Tweet id: 1828944100013314239\n",
      "Created at: 2024-08-28T23:53:48.000Z\n",
      "--------------------\n",
      "92\n",
      "Tweet id: 1828944013908726134\n",
      "Created at: 2024-08-28T23:53:27.000Z\n",
      "--------------------\n",
      "93\n",
      "Tweet id: 1828944000151359850\n",
      "Created at: 2024-08-28T23:53:24.000Z\n",
      "--------------------\n",
      "94\n",
      "Tweet id: 1828943984905113758\n",
      "Created at: 2024-08-28T23:53:20.000Z\n",
      "--------------------\n",
      "95\n",
      "Tweet id: 1828943968819703912\n",
      "Created at: 2024-08-28T23:53:16.000Z\n",
      "--------------------\n",
      "96\n",
      "Tweet id: 1828943968736031098\n",
      "Created at: 2024-08-28T23:53:16.000Z\n",
      "--------------------\n",
      "97\n",
      "Tweet id: 1828943957239468272\n",
      "Created at: 2024-08-28T23:53:14.000Z\n",
      "--------------------\n",
      "98\n",
      "Tweet id: 1828943951367467504\n",
      "Created at: 2024-08-28T23:53:12.000Z\n",
      "--------------------\n",
      "99\n",
      "Tweet id: 1828943925257863262\n",
      "Created at: 2024-08-28T23:53:06.000Z\n",
      "--------------------\n",
      "100\n",
      "Tweet id: 1828943919025139839\n",
      "Created at: 2024-08-28T23:53:05.000Z\n",
      "--------------------\n"
     ]
    }
   ],
   "source": [
    "# loop that fetches tweets from one day\n",
    "start_time = datetime.datetime.strptime(\"2024-08-28T00:00:00Z\", \"%Y-%m-%dT%H:%M:%SZ\")\n",
    "previous_time = \"2024-08-28T00:00:00Z\"\n",
    "for i in range(144):\n",
    "  timestamp = start_time + datetime.timedelta(minutes=10 * (i+1))\n",
    "  timestamp_str = timestamp.strftime(\"%Y-%m-%dT%H:%M:%SZ\")\n",
    "  print(timestamp_str)\n",
    "  populate_database(previous_time,timestamp_str)\n",
    "  previous_time = timestamp_str"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "88dd5a32-19d6-4c82-a524-e5f10fd81e76",
   "metadata": {},
   "outputs": [],
   "source": [
    "# make text embedding for cleaned tweet\n",
    "def get_embedding(text, model=\"text-embedding-3-small\"):\n",
    "   text = text.replace(\"\\n\", \" \")\n",
    "   return client.embeddings.create(input = [text], model=model).data[0].embedding\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "533eaa06-0c52-47a7-bb06-724a2cfe06be",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create author and relationships between author and tweet\n",
    "def create_author_and_tweet_relationships(authorid, tweetid):\n",
    "    # Create the relationship between Tweet and Author\n",
    "    create_relationship_query = \"\"\"\n",
    "    MATCH (tweet:Tweet {id: $tweetid}), (author:Author {id: $authorid})\n",
    "    MERGE (author)-[:POSTED]->(tweet)\n",
    "    \"\"\"\n",
    "    graph.query(create_relationship_query, params={\"tweetid\": tweetid, \"authorid\": authorid})\n",
    "\n",
    "    # Create the BELONGS_TO relationship between Tweet and Author\n",
    "    create_belongs_to_relationship_query = \"\"\"\n",
    "    MATCH (tweet:Tweet {id: $tweetid}), (author:Author {id: $authorid})\n",
    "    MERGE (tweet)-[:BELONGS_TO]->(author)\n",
    "    \"\"\"\n",
    "    graph.query(create_belongs_to_relationship_query, params={\"tweetid\": tweetid, \"authorid\": authorid})\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "61030fe4-0e7a-44e9-9ead-89d3de3b9e5d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# fetch tweets from the graph database and clean them\n",
    "def clean_text_and_embedd(number_of_rec):\n",
    "    # Fetch chunks where the tweets are not cleaned\n",
    "    query = \"MATCH (chunk:Tweet) WHERE chunk.cleantext IS NULL RETURN chunk\"\n",
    "    chunks = graph.query(query)\n",
    "\n",
    "    count = 1\n",
    "    for record in chunks:\n",
    "    #    print(count)\n",
    "        chunk = record['chunk']\n",
    "        tweetid = chunk['id']\n",
    "        text = chunk['text']\n",
    "        print(\"Original tweet: \")\n",
    "        print(\"\")\n",
    "        print(text)\n",
    "        authorid = chunk['author_id']\n",
    "        cleaned_tweet = clean_tweet(text)\n",
    "        print(\"\")\n",
    "        print(\"Tweet after cleaning:\")\n",
    "        print(\"\")\n",
    "        print(cleaned_tweet)\n",
    "        cleantweet = json.loads(cleaned_tweet)\n",
    "        cleantext = cleantweet.get(\"text\")\n",
    "        category = cleantweet.get(\"category\")\n",
    "        vector = \"\"\n",
    "        if cleantext != \"\":\n",
    "            vector = get_embedding(cleantext)\n",
    "\n",
    "        # Update the chunk with the encoded vector\n",
    "        update_query = \"\"\"\n",
    "        MATCH (chunk:Tweet {id: $tweetid})\n",
    "        SET chunk.cleantext = $cleantext\n",
    "        SET chunk.category = $category\n",
    "        SET chunk.textEmbedding = $vector\n",
    "        \"\"\"\n",
    "        graph.query(update_query, params={\"tweetid\": tweetid, \"cleantext\": cleantext, \"category\": category, \"vector\": vector})\n",
    "\n",
    "        create_author(authorid)\n",
    "        create_author_and_tweet_relationships(authorid, tweetid)\n",
    "        if count == number_of_rec:\n",
    "            break;\n",
    "        count = count +1 \n",
    "        print(\"-\" * 20)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "89ceb7e8-276e-44dd-b623-3f527d8be503",
   "metadata": {},
   "outputs": [],
   "source": [
    "number_of_rec = 6000\n",
    "clean_text_and_embedd(number_of_rec)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "4781dc2c-7452-4ffb-b5e6-aa0fdfdc329d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create author to graph database\n",
    "create_author = \"\"\"\n",
    "MERGE (chunk:Author {id: $chunkParam.id})\n",
    "ON CREATE SET \n",
    "    chunk.name = $chunkParam.name,\n",
    "    chunk.username = $chunkParam.username,\n",
    "RETURN chunk\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "9154ed93-7908-4680-80a8-d3f31e805f12",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "CREATE CONSTRAINT unique_author IF NOT EXISTS \n",
    "    FOR (c:Author) REQUIRE c.id IS UNIQUE\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "bea8db5c-d90e-4f3e-84c6-b61d8c40e24b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# find a user data from X using the user id\n",
    "def get_user_by_id(user_id):\n",
    "  url = f\"https://api.twitter.com/2/users/{user_id}\"\n",
    "  headers = create_headers(BEARER_TOKEN)\n",
    "  response = requests.get(url, headers=headers)\n",
    "  if response.status_code != 200:\n",
    "    raise Exception(response.status_code, response.text)\n",
    "  return response.json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "fec8ccac-7a75-4957-91b8-26d4b6edbc7b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create author to graph database\n",
    "def create_author(authorid):\n",
    "\n",
    "  #  print(\"creating author: \",authorid)\n",
    "    author_query = \"MATCH (author:Author {id: $authorid}) RETURN author\"\n",
    "    authors = graph.query(author_query, params={\"authorid\": authorid})\n",
    "\n",
    "    if not authors:\n",
    "        user_data = get_user_by_id(authorid)\n",
    "   #     print(user_data)\n",
    "        create_author_query = \"\"\"\n",
    "        MERGE (author:Author {id: $authorid})\n",
    "        ON CREATE SET \n",
    "            author.name = $name,\n",
    "            author.username = $username\n",
    "        RETURN author\n",
    "        \"\"\"\n",
    "            \n",
    "        graph.query(create_author_query, params={\"authorid\": authorid, \"name\": user_data['data']['name'], \"username\": user_data['data']['username']})\n",
    "\n",
    "        parent_query = \"MATCH (parentnode:X) RETURN parentnode\"\n",
    "        parentnodes = graph.query(parent_query)\n",
    "        if not parentnodes:\n",
    "            print(\"creating author's parent\")\n",
    "            create_parent_node = \"\"\"\n",
    "            MERGE (parentnode:X {name: $name})\n",
    "            RETURN parentnode\n",
    "            \"\"\"\n",
    "            graph.query(create_parent_node, params={\"name\": \"X\"})\n",
    "\n",
    "        # Create the USER_OF relationship between Author and X\n",
    "        create_user_relationship_query = \"\"\"\n",
    "        MATCH (parent:X {name: $name}), (author:Author {id: $authorid})\n",
    "        MERGE (author)-[:USER_OF]->(parent)\n",
    "        \"\"\"\n",
    "        graph.query(create_user_relationship_query, params={\"name\":\"X\", \"authorid\": authorid})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 243,
   "id": "9d5de050-051d-4a05-bfa7-dd0642357d6d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create node X if not yet existing in graph databse\n",
    "parent_query = \"MATCH (parentnode:X) RETURN parentnode\"\n",
    "parentnodes = graph.query(parent_query)\n",
    "if not parentnodes:\n",
    "    print(\"creating author's parent\")\n",
    "    create_parent_node = \"\"\"\n",
    "    MERGE (parentnode:X {name: $name})\n",
    "    RETURN parentnode\n",
    "    \"\"\"\n",
    "    graph.query(create_parent_node, params={\"name\": \"X\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "13c3c350-b869-42be-bceb-fc0b3b851de4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create vector index\n",
    "graph.query(\"\"\"\n",
    "         CREATE VECTOR INDEX `tweets` IF NOT EXISTS\n",
    "          FOR (t:Tweet) ON (t.textEmbedding) \n",
    "          OPTIONS { indexConfig: {\n",
    "            `vector.dimensions`: 1536,\n",
    "            `vector.similarity_function`: 'cosine'    \n",
    "         }}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "id": "3975db34-76af-48ca-92f1-907e71835a54",
   "metadata": {},
   "outputs": [],
   "source": [
    "# make a search to graph database\n",
    "def neo4j_vector_search(question, start_time, end_time, category):\n",
    "\n",
    "    # Encode the question to get the embedding\n",
    "    question_embedding = get_embedding(question)\n",
    "\n",
    "    # Perform the vector search using the encoded embedding\n",
    "    vector_search_query = \"\"\"\n",
    "    CALL db.index.vector.queryNodes($index_name, $top_k, $question_embedding) YIELD node, score\n",
    "    WHERE node.created_at >= $start_time AND node.created_at <= $end_time\n",
    "    AND node.category IN $category\n",
    "    RETURN score, node.created_at AS date, node.text AS text\n",
    "    \"\"\"\n",
    "    similar = graph.query(vector_search_query, \n",
    "                       params={\n",
    "                        'question_embedding': question_embedding, \n",
    "                        'index_name': VECTOR_INDEX_NAME, \n",
    "                        'top_k': 100,\n",
    "                        'start_time': start_time,\n",
    "                        'end_time': end_time,\n",
    "                        'category': category\n",
    "                       })\n",
    "    return similar"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "bbc670f7-fe5a-4259-bc1a-c5fe155ddc2f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create LLM answer to question\n",
    "def create_answer(question, start_time, end_time, category):\n",
    "\n",
    "    # first find the best answers from graph database\n",
    "    search_results = neo4j_vector_search(question, start_time, end_time, category)\n",
    " \n",
    "\n",
    "    messages = []\n",
    "    system_instructions = \"\"\"You assist user to create summaries based on the CONTEXT: documents. Use vector index scores, 'score' in json, to find the most relevant answer to user question. If you do not know, answer 'I don't know.'\"\"\" \n",
    "\n",
    "    messages.append(\n",
    "                    {\n",
    "                        \"role\": \"system\", \n",
    "                        \"content\": system_instructions\n",
    "                    })\n",
    "\n",
    "    prompt_template = \"\"\"{question} \\n\\nCONTEXT: {search_results}\"\"\"\n",
    "    messages.append(\n",
    "                    {\n",
    "                        \"role\": \"user\", \n",
    "                        \"content\": prompt_template.format(question=question, search_results=search_results)\n",
    "                    })\n",
    "\n",
    "    # Openai response generation\n",
    "    response = client.chat.completions.create(\n",
    "                model = \"gpt-4o-2024-05-13\",\n",
    "                messages = messages,\n",
    "                temperature = 0.1,\n",
    "                max_tokens = 2048,\n",
    "                top_p = 1.0)\n",
    "    return response.choices[0].message.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f110c890-0ebe-4fb0-97b2-0d8ff0cee2b6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e909eab3-ca47-4dd0-8e4c-013c2fd60d12",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "1b5911fb-9a9f-4cef-9d6a-268d63fea229",
   "metadata": {},
   "source": [
    "# Usage"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "id": "a525f698-5c8d-40b4-8675-1a544c9aca72",
   "metadata": {},
   "outputs": [],
   "source": [
    "start_time = \"2024-08-28T00:00:00Z\"\n",
    "end_time = \"2024-08-28T21:00:00Z\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "id": "ee003a90-ec6e-43e3-9ee5-a2afa6e153e7",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\", \"No\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 179,
   "id": "0f397c69-f591-440d-99cb-829887188716",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"Nvidia's biggest concerns revolve around several key areas that are frequently mentioned in the context of their business and market performance. One of the primary concerns is the high expectations surrounding their earnings reports. The anticipation and scrutiny from investors and analysts create significant pressure on Nvidia to consistently deliver strong financial results. This is evident from the numerous mentions of their earnings and the market's reaction to their financial performance. The company's ability to meet or exceed these expectations is crucial, as any disappointment could lead to a sharp decline in their stock price and investor confidence.\\n\\nAnother major concern for Nvidia is the competitive landscape in the technology and semiconductor industry. The rapid advancements in artificial intelligence (AI) and other cutting-edge technologies mean that Nvidia must continuously innovate to maintain its market leadership. The demand for AI chips and other advanced technologies is growing exponentially, and Nvidia faces the challenge of staying ahead of competitors who are also investing heavily in these areas. The company's ability to develop and market new products that meet the evolving needs of the industry is critical to its long-term success.\\n\\nLastly, Nvidia is also concerned about the broader market conditions and their impact on the company's performance. The global economic environment, including factors such as inflation, supply chain disruptions, and geopolitical tensions, can significantly affect Nvidia's operations and profitability. The company's reliance on a complex supply chain for its chip production makes it vulnerable to these external factors. Additionally, the overall sentiment in the financial markets can influence Nvidia's stock performance, as seen from the heightened attention and speculation around their earnings reports. Managing these external risks and maintaining operational efficiency are essential for Nvidia to navigate the uncertainties in the global market.\""
      ]
     },
     "execution_count": 179,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What are Nvidia's biggest concerns? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "id": "a8c5a190-235b-4c7a-95bc-b4b4cb423068",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 183,
   "id": "cbaa6f04-62dd-490e-a0e9-82e7b1d0ea0d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"Nvidia's biggest concerns revolve primarily around meeting the high market expectations set by the exponential growth in demand for AI and advanced technology chips. The market has placed significant pressure on Nvidia to deliver strong financial results, and any deviation from these expectations could lead to negative consequences. This is evident from the anticipation surrounding their earnings reports and the potential market reactions if Nvidia fails to meet these high expectations.\\n\\nAnother major concern for Nvidia is overcoming obstacles that could impact their earnings. Analysts and investors are closely watching for any signs of challenges that could hinder Nvidia's performance. These obstacles could range from supply chain issues to increased competition in the semiconductor industry. The focus on Nvidia's ability to navigate these challenges is critical, as any misstep could affect their market position and investor confidence.\\n\\nLastly, the global market's attention on Nvidia's financial disclosures highlights the importance of their sales forecasts, particularly in AI technologies. Nvidia's ability to accurately predict and meet sales expectations in this rapidly growing sector is crucial. Any discrepancies between their forecasts and actual performance could lead to significant market volatility. Therefore, maintaining a strong and consistent growth trajectory in AI chip sales is a key concern for Nvidia as they strive to uphold their status as a leading chip manufacturer.\""
      ]
     },
     "execution_count": 183,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What are Nvidia's biggest concerns? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 185,
   "id": "feb8d158-27d1-43b2-9992-1085f5d9d125",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\", \"No\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "e44b8b24-4659-4657-bd92-23f925710515",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'The CONTEXT does not provide a definitive answer on whether Nvidia\\'s stock will go up or down. However, several recurring themes and sentiments can be observed. Many sources express anticipation and uncertainty regarding Nvidia\\'s upcoming earnings report. There is a general consensus that the earnings report will have a significant impact on the stock market, with some predicting a potential for either a substantial rise or a notable decline in Nvidia\\'s stock price. This uncertainty is reflected in the mixed expectations of analysts and investors.\\n\\nAnother common theme is the importance of Nvidia\\'s earnings report not just for the company itself, but for the broader market. Many comments suggest that Nvidia\\'s performance could influence the overall direction of the stock market, particularly in the tech sector. This is due to Nvidia\\'s significant role in the market and its recent trends in AI and semiconductor technology. The anticipation is so high that some sources describe the market as being in a state of \"nervous anticipation\" or \"holding its breath\" ahead of the earnings announcement.\\n\\nLastly, there is a notable focus on Nvidia\\'s guidance and future outlook rather than just the immediate earnings figures. Several sources emphasize that the market\\'s reaction will depend heavily on Nvidia\\'s projections for future growth and performance. This includes expectations around AI spending, chip demand, and overall market conditions. The sentiment is that while Nvidia\\'s past performance has been strong, the key factor will be whether the company can continue to meet or exceed market expectations moving forward.'"
      ]
     },
     "execution_count": 187,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What does the CONTEXT: say, will Nvidia stock go up or down? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "id": "51a98b9a-df24-4174-8b9a-577bd21437d3",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "51fe12de-09cc-459f-8b46-c2a9ccba42a7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'The CONTEXT reveals a significant amount of speculation and anticipation surrounding Nvidia\\'s stock performance, particularly in relation to its upcoming earnings report. Many sources suggest that Nvidia\\'s earnings will have a substantial impact on the stock market, with some predicting a potential for record share prices. However, there is also a notable amount of uncertainty, with opinions divided on whether the stock will rise or fall. This uncertainty is reflected in the sentiment that Nvidia\\'s performance could either lead to a market rally or a significant downturn.\\n\\nSeveral sources highlight the importance of Nvidia\\'s earnings report, noting that it could be a \"make or break\" moment for the market. The anticipation is not just about the earnings themselves but also about the guidance and future outlook that Nvidia will provide. Some analysts and traders are preparing for significant volatility, with expectations ranging from a 50% increase to a 30% decrease in stock price. This wide range of potential outcomes underscores the high stakes and the polarized views within the investment community.\\n\\nRecurrent themes in the CONTEXT include the potential for Nvidia\\'s stock to either soar or stumble based on its earnings report. There is a consensus that the results will have a ripple effect on the broader market, particularly on other tech and semiconductor stocks. Despite the mixed predictions, there is a clear emphasis on the importance of staying strategic and not letting emotions dictate trading decisions. The overall sentiment is one of cautious optimism, tempered by the recognition of the inherent risks and uncertainties.'"
      ]
     },
     "execution_count": 191,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What does the CONTEXT: say, will Nvidia stock go up or down? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "526b77da-9a68-463d-ae63-a2909672b33d",
   "metadata": {},
   "outputs": [],
   "source": [
    "start_time = \"2024-08-28T21:00:00Z\"\n",
    "end_time = \"2024-08-28T23:59:00Z\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "c5006e25-d0b6-4008-8282-3d20502bf165",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\", \"No\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "1dfea9a2-ceee-4c60-812c-cbeb6a5ba1a4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'The recent earnings report from NVIDIA has had a significant impact on the market, with mixed reactions observed across different sectors. Despite the positive earnings results, which exceeded expectations, the overall market response was paradoxical. For instance, while NVIDIA\\'s performance was strong, the Dow Jones Industrial Average experienced a decline. This contradictory reaction highlights the complexity of market dynamics and suggests that investor expectations and broader economic factors play crucial roles in shaping market responses to earnings reports.\\n\\nSeveral commentators noted that despite the strong earnings, NVIDIA\\'s stock price did not see the anticipated rise. This phenomenon has been observed in previous earnings reports as well, where positive results did not translate into immediate stock price increases. Some analysts suggest that this could be due to the high expectations already priced into the stock, leading to a \"sell the news\" scenario where investors take profits after the announcement. This pattern indicates that while the company\\'s fundamentals are strong, market sentiment and timing are critical factors influencing stock performance.\\n\\nThe impact of NVIDIA\\'s earnings extends beyond its stock price, affecting broader market indices and sectors. The technology sector, in particular, is closely watched for its reaction to NVIDIA\\'s performance, given the company\\'s significant role in the industry. Additionally, the earnings report has implications for international markets, such as the Nikkei 225, where strategists are keenly observing how the Japanese market will respond. Overall, NVIDIA\\'s earnings report underscores the interconnectedness of global markets and the importance of strategic analysis in navigating post-earnings market movements.'"
      ]
     },
     "execution_count": 197,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What was the impact of earning result? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "7cc6d397-65ea-4ec0-b9d0-0060e6d7d5d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "category=[\"Yes\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "e6e39ee1-2c30-4405-9444-c0aa63c5ba8c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"The recent earnings report from NVIDIA had a notable impact on the financial markets, showcasing a paradox where the company's positive earnings did not translate into an immediate rise in the stock market. Despite the favorable earnings report, the Dow Jones Industrial Average experienced a decline. This unexpected reaction highlights the complexity of market dynamics and suggests that investors may have had other concerns or were engaging in profit-taking activities. The situation presents a challenge for strategists and analysts who must interpret these mixed signals to guide their investment decisions.\\n\\nIn the context of the Japanese stock market, the reaction to NVIDIA's earnings report is anticipated to be cautious. The Tokyo Stock Exchange is expected to exhibit a weak trend following the initial decline. This cautious sentiment reflects the interconnectedness of global markets and the influence of major tech companies like NVIDIA on investor behavior worldwide. Analysts and strategists in Japan will need to carefully assess the implications of NVIDIA's earnings and the broader market sentiment to make informed predictions about the Nikkei 225's performance.\\n\\nFor investors, the mixed market reaction to NVIDIA's earnings report could present buying opportunities, particularly in the technology sector. The decline in stock prices, despite strong earnings, may be seen as a chance to purchase shares at a lower price, anticipating future gains. However, it is crucial for investors to remain vigilant and consider the broader market conditions and potential risks. The overall impact of NVIDIA's earnings underscores the importance of thorough analysis and strategic planning in investment decisions, especially in a volatile market environment.\""
      ]
     },
     "execution_count": 201,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "create_answer(\"What was the impact of earning result? Collect things that repeat in CONTEXT. Write 3 paragraphs.\",start_time, end_time, category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2c81b94b-9740-4df3-81f4-d2c7ed3a6732",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "tweet",
   "language": "python",
   "name": "tweet"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
